app/controllers/customer_sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "non-existent@123.com"], ["LIMIT", 1]]
---
  def create
    customer = Customer.find_by(email: params[:session][:email])