app/controllers/sessions_controller.rb

  def create
    customer = Customer.find_by(email: params[:session][:email])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "test@test.com"], ["LIMIT", 1]]